{
"Text": [
"Regalinatio, 2029",
"Lawrence approached the window and looked outside.",
"Maco: Where are you now?",
"Maco spoke through the phone.",
"Lawrence: Just arrived at the scouting point.",
"Maco: The target probably arrived in a black sedan. Keep an eye out.",
"Under the dark sky, only the silence flowed from the road, and the streetlight spilled through the window frame.",
"Lawrence: Nothing yet. Looks like I got here a bit early.",
"Maco: Hopefully not too late.",
"Lawrence leaned closer to the window, peering at the road visible from the side.",
"Lawrence: The Freiheits guys are gathering. Doesn't seem like I'm late.",
"Maco: Getting out might not be easy though.",
"Lawrence: Don't worry. Finding an escape route is my job.",
"Maco: Just don't stir up trouble. Supplies for treating injuries are running low.",
"Maco: Your daughter is also at our hideout, so be careful and come back.",
"Lawrence: Phi? Why is she there?",
"Maco: There aren't many safe places in times like these.",
"Maco: Plus, there's the issue of supplies...",
"Lawrence: I see the vehicle. I'll contact you later.",
"Lawrence hung up the phone and watched the black vehicle.",
"Approaching with its cold headlights, the vehicle slowly stopped in front of the opposite building.",
"Only one vehicle...",
"She had expected a procession, hoping for the appearance of a general.",
"As the vehicle's door opened, a military officer and two soldiers who seemed like guards got out.",
"Looking closely at the officer's uniform, it confirmed Lawrence's expectation of a general.",
"General Benner, who led the Freiheits army and established a puppet government in Regalinatio.",
"There must have been internal collaborators for the invasion to proceed smoothly.",
"Sure enough, a man in a suit emerged from the opposite building and approached Benner.",
"It was Toma, a member of the Regalinatio Parliament.",
"Lawrence quickly took out his phone and took a photo.",
"She captured both Benner and Toma making contact.",
"After gathering enough information, Lawrence moved away from the window showing the scene.",
"It was time to return to the hideout, away from the sight of the Freiheits army."
]
}